tutorials/A.Jacobsen_2025/caseA/0.orig/UNe
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      UNe;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform -1.4;



boundaryField
{
    PNe
    {
        type            uniformFixedValue;
        uniformValue 	table
        (
        (0 -1.4)
	//(25 -1.4)(37.5 -1.6)(50 -1.6)(62.5 -1.8)(75 -1.8)(87.5 -2)(100 -2)(112.5 -2.2)(125 -2.2)(137.5 -2.4)(150 -2.4)(162.5 -2.6)(175 -2.6)
	(0.5 -1.4)
	(1 -2.6)
        );
    }
    PPe
    {
	type		zeroGradient;
    }

    frontAndBack
    {
	type		empty;
    }
    Inlet1
    {
    	type		zeroGradient;
    }
    Inlet2
    {
    	type		zeroGradient;
    }
    Outlet1
    {
        type            zeroGradient;
    }
    Outlet2
    {
        type            zeroGradient;
    }
        OWall
    {
	type 		zeroGradient;
        
    }
    Walls
    {
	type 		zeroGradient;
    }
    
}


// ************************************************************************* //
