tutorials/A.Jacobsen_2025/caseA/constant/fvOptions_
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Ny		30e-3;
Nz		1e-3;
tPe		1.8e-3;
tDi		0.85e-3;
tNe		1.8e-3;
cellLength	200e-3;
cellDepth	30e-3;



t2 #eval #{ $tPe+$tDi #};
t3 #eval #{ $tPe+$tDi+$tNe #};

KPe	763000000.0;
betaPe	0;
KD	8.85e17;
betaD	0;
porosity1
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;

        cellZone        positiveElectode;

        type            DarcyForchheimer;

        d   ($KPe $KPe $KPe);
    	f   ($betaPe $betaPe $betaPe);

    	coordinateSystem
    	{
        	origin  (0 0 0);
        	e1      ($cellLength 0 0);
        	e2      (0 $tPe $cellDepth);
    	}
    }
}

porosity2
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;

        cellZone        diaphram;

        type            DarcyForchheimer;

        d   ($KD $KD $KD);
    	f   ($betaD $betaD $betaD);

    	coordinateSystem
    	{
        	origin  (0 0 0);
        	e1      (0 $tPe 0);
        	e2      ($cellLength $t2 $cellDepth);
    	}
    }
}
porosity3
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;

        cellZone        negativeElectode;

        type            DarcyForchheimer;

        d   ($KPe $KPe $KPe);
    	f   ($betaPe $betaPe $betaPe);

    	coordinateSystem
    	{
        	origin  (0 0 0);
        	e1      (0 $t2 0);
        	e2      ($cellLength $t3 $cellDepth);
    	}
    }
}
porosity4
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;

        cellZone        positiveChannel;

        type            DarcyForchheimer;

        d   ($KPe $KPe $KPe);
    	f   ($betaPe $betaPe $betaPe);

    	coordinateSystem
    	{
        	origin  (0 0 0);
        	e1      ($cellLength 0 0);
        	e2      (0 $tPe $cellDepth);
    	}
    }
}
porosity5
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;

        cellZone        negativeChannel;

        type            DarcyForchheimer;

        d   ($KPe $KPe $KPe);
    	f   ($betaPe $betaPe $betaPe);

    	coordinateSystem
    	{
        	origin  (0 0 0);
        	e1      ($cellLength 0 0);
        	e2      (0 $tPe $cellDepth);
    	}
    }
}


// ************************************************************************* //
