tutorials/A.Jacobsen_2025/caseA/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
RDB		0.05e-3;
RDB_Ne		0.05e-3;
RDB_Pe		0.075e-3;
phases          (gas electrolyte);

gas
{
    transportModel  Beckermann;

    rho             0.0645;
    nud		    1.44e-4;
    mu		    1e-5;
    
    //related to diffusion between phases.
    zeta	1;
    C_star	1; //rigid spheres
    Da		0.16;
    Db		0.81;
    D1_ref	1.213e-4;//depends on temperature and pressure. needs to be added at some point.
    waterVapour 	true;
    "(Beckermann|Ishii|linearMu)Coeffs"
    {
    
    
    
    mu_ref_H2		    8.411e-6;
    mu_ref_O2		    1.919e-5;
    mu_ref_H2O		    9.81e-6;
    
    T_muref_H2		    273.15;
    T_muref_O2		    300;	//273.15
    T_muref_H2O		    300;
    
    n_mu_H2		    0.67;
    n_mu_O2		    0.754;
    n_mu_H2O		    1.1;
    
    //Beckermann
    kr_Ne		1.25;//BECKKR;
    kr_Pe       1.25;
    kr_Mem      3;
    }
}

electrolyte
{
    	transportModel  Newtonian;

    	nu              1.6e-06;
    	rho             1231;
    	mu		1.968e-3;
}

capillaryPressureModel noPc;

"(leverett|noPc)Coeffs"
{

    sigma   72;
    thetaDeg    15;
    alphaWetMin 0;
    alphaWetMax 0.5;
}

pore:RelativeVelocityModel stokes;//viscousRegime;//simpleIshii;//
free:RelativeVelocityModel SchillingsU;

"free:(combined|combinedDiffusion|combinedME|combinedFixedD|stokes|SchillingsU)Coeffs"
{
    hF          0;//how much the velocity is reduced, 0 is free rasing bubble, only active in Pe and Ne
    rd_Ne		$RDB_Ne;
    rd_Pe		$RDB_Pe;
    R_DB_Ne        $RDB_Ne;
    R_DB_Pe        $RDB_Pe;
    
    
    n               	5;//2.4;
    minAlphad		1;
    

    free:phaseDiffusionModel Schillings;
    "(constant|noDiffusion|Ishii|Schillings)Coeffs"
    {
        DiffusionConstant   1e-6;
        dF          1;//how much the dispersion is incressed, 1 is defined dispersion, only active in Pe and Ne
        
        //---Schillings---
        n                   5;
        diffCoeffGravity    8;
        diffCoeffGravityNormal  1;
        bubbleRadius_Ne    $RDB_Ne;
        bubbleRadius_Pe    $RDB_Pe;
    }
    
}


"pore:stokesCoeffs"
{
    hF          2;//how much the velocity is reduced, 0 is free rasing bubble, only active in Pe and Ne
    rd_Ne		$RDB_Ne;
    rd_Pe		$RDB_Pe;
    n              	5;//2.4;
    minAlphad		1;

    

        pore:phaseDiffusionModel constant; //represents the static bubbles
        "(constant|noDiffusion|Ishii|Schillings|simple|simpleP|capillaryD)Coeffs"
        {
        
            rd_Ne		$RDB_Ne;
            rd_Pe		$RDB_Pe;
            
            D_Ne_		8;
            D_Ne			($D_Ne_ 0 0
            				 0 #eval{$D_Ne_/8} 0
            				 0 0 #eval{$D_Ne_/8});//1;

            D_Pe_		8;
            D_Pe			($D_Pe_ 0 0
            				 0 #eval{$D_Pe_/8} 0
            				 0 0 #eval{$D_Pe_/8});//1;
        }
}


coverageModel linearVogt;

"(linearCoverage|vogt|linearVogt|zeroCoverage)Coeffs"
{
	//vogt
	J_lim		300000.0;   ///from vogt
	J_scale		1;
	Temperature_ref	298.15;
	//linear coverage
	n		1;	//power of linear coverage
}

concentrationLossModel constantRatio;

"(constantRatio|fixedReferenceValue|localReference)Coeffs"
{
stoichiometricCoefficient true; //use stoichiometricCoefficient as exponent CR[i]^n.:=
//used in "constantRatio"

//used in "fixedReferenceValue"
	C_ref_OH 	6851.19;
	C_ref_H2O 	48810;
	C_ref_H2 	1;
	C_ref_O2 	1;
	//exponent, CR[i]^n, all have to be specified, even when not truely used.
	n_Ne_H2		1;
	n_Ne_O2		1;
	n_Ne_H2O	2;
	n_Ne_OH		2;
	a_Ne		("H2");
	c_Ne		("H2O");
	
	
	n_Pe_H2		1;
	n_Pe_O2		0.5;
	n_Pe_H2O	1;
	n_Pe_OH		2;
	a_Pe		("OH");
	c_Pe		("O2");
	
}


speciesTransport
{
	wireModel	constantSherwood;
	
	"wireModel_generalCoeffs"
	{
		
		a	1.1;
		b	0.43;
		c	0.33;
		d_Ne	0.06e-3;
		d_Pe	0.06e-3;
		
	}
	"wireModel_constantSherwoodCoeffs"
	{
		
		sh_H2	100;
		sh_O2	100;
		sh_H2O	100;
		sh_OH	100;
		d_Ne	0.06e-3;
		d_Pe	0.06e-3;
		
	}

}

massAndSpeciesTransferModel mixedSaturation;
"(surfaceSaturation|mixedSaturation|bulkSaturation)Coeffs"
{

	

	waterVapour 	true;
	m_KOH		7.65; //[mol/kg] 7.65-> 30wt%	
	
	AttachedBubbleGrowthModel	constantSherwood;
	"AttachedBubbleGrowthModel_constantSherwoodCoeffs"
		{
		
		sh_H2	1;
		sh_O2	1;
		sh_H2O	0;
		sh_OH	0;
		d_Ne	5e-05;
		d_Pe	5e-05;
		
	}
	"AttachedBubbleGrowthModel_(generalR|general)Coeffs"
	{
		
		a	1.1;
		b	0.43;
		c	0.33;
		d_Ne	5e-05;
		d_Pe	5e-05;
		
	}
	DetachedBubbleGrowthModel	constantSherwood;
	"DetachedBubbleGrowthModel_constantSherwoodCoeffs"
	{
		sh_H2	1;
		sh_O2	1;
		sh_H2O	0;
		sh_OH	0;
		d_Ne	0.0001;
		d_Pe	0.0001;
	}
	"DetachedBubbleGrowthModel_(WhitakerR|Whitaker)Coeffs"
	{

		d_Ne	0.0001;
		d_Pe	0.0001;
	}
	
    //surface scaling for attached bubbles
	c_AB	4;//4//163; //angle=9deg
   
}
p_num		101325;

//mole weight
MW_H2		2.01588e-3;	//kg/mol
MW_O2		31.9988e-3;	//kg/mol
MW_OH		17.007e-3;	//kg/mol
MW_H2O		18.01528e-3;	//kg/mol
MW_K		39.10e-3;	//kg/mol


// ************************************************************************* //
